--drop table spr_countries
--ALTER TABLE tcbt ALTER COLUMN stoim TYPE numeric USING stoim::numeric

--CREATE INDEX idx_left_6 ON tcbt(left(tnved,6));

select napr,right(period,4) as "god",sum(stoim)/1000000
from tcbt
where right(period,4) = '2018'--and tnved <> 'SSSSSS'
group by napr,right(period,4)
order by god

--
--list 3-------------------------------------------------------------------------------
---расчет по группам (лист 3)
--!!! следить за SSSSSS
drop materialized view list_3_export cascade
create materialized view list_3_export as 
select case 
			when "Страна" in ('АЗЕРБАЙДЖАН', 'АРМЕНИЯ', 'БЕЛАРУСЬ', 'КАЗАХСТАН', 'КИРГИЗИЯ', 'МОЛДОВА, РЕСПУБЛИКА', 'ТАДЖИКИСТАН', 'ТУРКМЕНИЯ', 'УЗБЕКИСТАН', 'УКРАИНА') then 'СНГ'
			when "Страна" in ('АВСТРАЛИЯ','АВСТРИЯ','БЕЛЬГИЯ',	'СОЕДИНЕННОЕ КОРОЛЕВСТВО','ВЕНГРИЯ',	'ГЕРМАНИЯ',	'ГРЕЦИЯ','ДАНИЯ',	'ИЗРАИЛЬ',	'ИРЛАНДИЯ',	'ИСЛАНДИЯ',	'ИСПАНИЯ','ИТАЛИЯ','КАНАДА','ЛАТВИЯ','ЛЮКСЕМБУРГ','МЕКСИКА','НИДЕРЛАНДЫ','НОВАЯ ЗЕЛАНДИЯ',	'НОРВЕГИЯ',	'ПОЛЬША','ПОРТУГАЛИЯ','КОРЕЯ, РЕСПУБЛИКА','СЛОВАКИЯ',	'СЛОВЕНИЯ',	'СОЕДИНЕННЫЕ ШТАТЫ','ТУРЦИЯ','ФИНЛЯНДИЯ','ФРАНЦИЯ','ЧЕХИЯ','ЧИЛИ','ШВЕЙЦАРИЯ','ШВЕЦИЯ','ЭСТОНИЯ','ЯПОНИЯ') then 'ОЭСР'
	   else 'Другие'
	   end "Группа стран",
"Страна", "Группа",  
sum(case when "Год"='2017' then "Сумма" end) "2017", sum(case when "Год"='2018' then "Сумма" end) "2018", sum(case when "Год"='2019' then "Сумма" end) "2019"
from (
select right(period,4) as "Год", spr_cntr."name" "Страна", 'nn' "Группа", sum(stoim)/1000000 as "Сумма"
from tcbt left join spr_cntr on (tcbt.strana = spr_cntr.kod)
where napr = 'ЭК' and
--nn
(left(tnved,2) in ('01',	'02',	'03',	'04',	'06',	'07',	'08',	'09',	'10',	'11',	'16',	'17',	'19',	'20',	'21',	'22',	'24',	'28',	'29',	'30',	'31',	'32',	'33',	'34',	'35',	'36',	'37',	'42',	'46',	'48',	'49',	'53',	'54',	'56',	'57',	'58',	'59',	'60',	'61',	'62',	'64',	'65',	'66',	'67',	'68',	'69',	'73',	'81',	'82',	'83',	'84',	'85',	'86',	'87',	'88',	'89',	'90',	'91',	'92',	'93',	'94',	'95',	'96',	'97')
or left(tnved,4) in ('0504',	'1201',	'1202',	'1203',	'1204',	'1205',	'1206',	'1207',	'1208',	'1209',	'1210',	'1212',	'1214',	'1302',	'1501',	'1502',	'1503',	'1504',	'1505',	'1506',	'1507',	'1508',	'1509',	'1510',	'1511',	'1512',	'1513',	'1514',	'1515',	'1516',	'1517',	'1518',	'1519',	'1520',	'1521',	'1801',	'1803',	'1804',	'1805',	'1806',	'2301',	'2304',	'2305',	'2306',	'2309',	'2523',	'3801',	'3802',	'3803',	'3805',	'3806',	'3807',	'3808',	'3809',	'3810',	'3811',	'3812',	'3813',	'3814',	'3815',	'3816',	'3817',	'3818',	'3819',	'3820',	'3821',	'3822',	'3823',	'3824',	'3826',	'3901',	'3902',	'3903',	'3904',	'3905',	'3906',	'3907',	'3908',	'3909',	'3910',	'3911',	'3912',	'3913',	'3914',	'3916',	'3917',	'3918',	'3919',	'3920',	'3921',	'3922',	'3923',	'3924',	'3925',	'3926',	'4002',	'4005',	'4006',	'4007',	'4008',	'4009',	'4010',	'4011',	'4012',	'4013',	'4014',	'4015',	'4016',	'4017',	'4104',	'4105',	'4106',	'4107',	'4108',	'4109',	'4110',	'4111',	'4112',	'4113',	'4114',	'4302',	'4303',	'4304',	'4402',	'4404',	'4405',	'4406',	'4407',	'4408',	'4409',	'4410',	'4411',	'4412',	'4413',	'4414',	'4415',	'4416',	'4417',	'4418',	'4419',	'4420',	'4421',	'4502',	'4503',	'4504',	'4701',	'4702',	'4703',	'4704',	'4705',	'4706',	'5004',	'5005',	'5006',	'5007',	'5105',	'5106',	'5107',	'5108',	'5109',	'5110',	'5111',	'5112',	'5113',	'5201',	'5203',	'5204',	'5205',	'5206',	'5207',	'5208',	'5209',	'5210',	'5211',	'5212',	'5501',	'5502',	'5503',	'5504',	'5506',	'5507',	'5508',	'5509',	'5510',	'5511',	'5512',	'5513',	'5514',	'5515',	'5516',	'6301',	'6302',	'6303',	'6304',	'6305',	'6306',	'6307',	'6308',	'6309',	'7002',	'7003',	'7004',	'7005',	'7006',	'7007',	'7008',	'7009',	'7010',	'7011',	'7012',	'7013',	'7014',	'7015',	'7016',	'7017',	'7018',	'7019',	'7020',	'7104',	'7105',	'7106',	'7107',	'7108',	'7109',	'7110',	'7111',	'7113',	'7114',	'7115',	'7116',	'7117',	'7118',	'7201',	'7202',	'7203',	'7205',	'7206',	'7207',	'7208',	'7209',	'7210',	'7211',	'7212',	'7213',	'7214',	'7215',	'7216',	'7217',	'7218',	'7219',	'7220',	'7221',	'7222',	'7223',	'7224',	'7225',	'7226',	'7227',	'7228',	'7229',	'7401',	'7402',	'7403',	'7405',	'7406',	'7407',	'7408',	'7409',	'7410',	'7411',	'7412',	'7413',	'7414',	'7415',	'7416',	'7417',	'7418',	'7419',	'7501',	'7502',	'7504',	'7505',	'7506',	'7507',	'7508',	'7601',	'7603',	'7604',	'7605',	'7606',	'7607',	'7608',	'7609',	'7610',	'7611',	'7612',	'7613',	'7614',	'7615',	'7616',	'7801',	'7804',	'7806',	'7901',	'7903',	'7904',	'7905',	'7906',	'7907',	'8001',	'8003',	'8007')
or left(tnved,6) in ('411510',	'710122',	'710229',	'710239',	'710391',	'710399', 'SSSSSS'))
group by "Год", spr_cntr."name"--, tnved
union all
--s
select right(period,4) as "Год", spr_cntr."name" "Страна", 's' "Группа", sum(stoim)/1000000 as "Сумма"
from tcbt left join spr_cntr on (tcbt.strana = spr_cntr.kod)
where napr = 'ЭК' and
(left(tnved,2) in ('14', '26')
or left(tnved,4) in ('0501',	'0502',	'0505',	'0506',	'0507',	'0508',	'0509',	'0510',	'0511',	'1211',	'1213',	'1301',	'1522',	'1802',	'2302',	'2303',	'2307',	'2308',	'2501',	'2502',	'2503',	'2504',	'2505',	'2506',	'2507',	'2508',	'2509',	'2510',	'2511',	'2512',	'2513',	'2514',	'2515',	'2516',	'2517',	'2518',	'2519',	'2520',	'2521',	'2522',	'2524',	'2525',	'2526',	'2527',	'2528',	'2529',	'2530',	'2701',	'2702',	'2703',	'2709',	'2714',	'3804',	'3825',	'3915',	'4001',	'4003',	'4004',	'4101',	'4102',	'4103',	'4301',	'4401',	'4403',	'4501',	'4707',	'5001',	'5002',	'5003',	'5101',	'5102',	'5103',	'5104',	'5202',	'5505',	'6310',	'7001',	'7112',	'7204',	'7404',	'7503',	'7602',	'7802',	'7902',	'8002')
or left(tnved,6) in ('271111',	'271121',	'411520',	'710110',	'710121',	'710210',	'710221',	'710231',	'710310'))
group by "Год", spr_cntr."name"--, tnved
union all
--ne
select right(period,4) as "Год", spr_cntr."name" "Страна", 'ne' "Группа", sum(stoim)/1000000 as "Сумма"
from tcbt left join spr_cntr on (tcbt.strana = spr_cntr.kod)
where napr = 'ЭК' and
(left(tnved,4) in ('2704',	'2705',	'2706',	'2707',	'2708',	'2710',	'2712',	'2713',	'2715',	'2716')
or left(tnved,6) in ('271112',	'271113',	'271114',	'271115',	'271116',	'271117',	'271118',	'271119',	'271129'))
group by "Год", spr_cntr."name"
) x
group by "Страна", "Группа"
order by  "Страна", "Группа"
--

select --count(*)
sum(stoim/1000000) 
from tcbt t 
where right(period,4) = '2018'
and napr = 'ЭК'

delete from tcbt
where right(period,4) = '2018'

----list 3-------------------------------------------------------------------------------------------------
drop materialized view list_3_import cascade
create materialized view list_3_import as 
select case 
			when "Страна" in ('АЗЕРБАЙДЖАН', 'АРМЕНИЯ', 'БЕЛАРУСЬ', 'КАЗАХСТАН', 'КИРГИЗИЯ', 'МОЛДОВА, РЕСПУБЛИКА', 'ТАДЖИКИСТАН', 'ТУРКМЕНИЯ', 'УЗБЕКИСТАН', 'УКРАИНА') then 'СНГ'
			when "Страна" in ('АВСТРАЛИЯ','АВСТРИЯ','БЕЛЬГИЯ',	'СОЕДИНЕННОЕ КОРОЛЕВСТВО','ВЕНГРИЯ',	'ГЕРМАНИЯ',	'ГРЕЦИЯ','ДАНИЯ',	'ИЗРАИЛЬ',	'ИРЛАНДИЯ',	'ИСЛАНДИЯ',	'ИСПАНИЯ','ИТАЛИЯ','КАНАДА','ЛАТВИЯ','ЛЮКСЕМБУРГ','МЕКСИКА','НИДЕРЛАНДЫ','НОВАЯ ЗЕЛАНДИЯ',	'НОРВЕГИЯ',	'ПОЛЬША','ПОРТУГАЛИЯ','КОРЕЯ, РЕСПУБЛИКА','СЛОВАКИЯ',	'СЛОВЕНИЯ',	'СОЕДИНЕННЫЕ ШТАТЫ','ТУРЦИЯ','ФИНЛЯНДИЯ','ФРАНЦИЯ','ЧЕХИЯ','ЧИЛИ','ШВЕЙЦАРИЯ','ШВЕЦИЯ','ЭСТОНИЯ','ЯПОНИЯ') then 'ОЭСР'
	   else 'Другие'
	   end "Группа стран",
"Страна", "Группа",  
sum(case when "Год"='2017' then "Сумма" end) "2017", sum(case when "Год"='2018' then "Сумма" end) "2018", sum(case when "Год"='2019' then "Сумма" end) "2019"
from (
select right(period,4) as "Год", spr_cntr."name" "Страна", 'nn' "Группа", sum(stoim)/1000000 as "Сумма"
from tcbt left join spr_cntr on (tcbt.strana = spr_cntr.kod)
where napr = 'ИМ' and
--nn
(left(tnved,2) in ('01',	'02',	'03',	'04',	'06',	'07',	'08',	'09',	'10',	'11',	'16',	'17',	'19',	'20',	'21',	'22',	'24',	'28',	'29',	'30',	'31',	'32',	'33',	'34',	'35',	'36',	'37',	'42',	'46',	'48',	'49',	'53',	'54',	'56',	'57',	'58',	'59',	'60',	'61',	'62',	'64',	'65',	'66',	'67',	'68',	'69',	'73',	'81',	'82',	'83',	'84',	'85',	'86',	'87',	'88',	'89',	'90',	'91',	'92',	'93',	'94',	'95',	'96',	'97')
or left(tnved,4) in ('0504',	'1201',	'1202',	'1203',	'1204',	'1205',	'1206',	'1207',	'1208',	'1209',	'1210',	'1212',	'1214',	'1302',	'1501',	'1502',	'1503',	'1504',	'1505',	'1506',	'1507',	'1508',	'1509',	'1510',	'1511',	'1512',	'1513',	'1514',	'1515',	'1516',	'1517',	'1518',	'1519',	'1520',	'1521',	'1801',	'1803',	'1804',	'1805',	'1806',	'2301',	'2304',	'2305',	'2306',	'2309',	'2523',	'3801',	'3802',	'3803',	'3805',	'3806',	'3807',	'3808',	'3809',	'3810',	'3811',	'3812',	'3813',	'3814',	'3815',	'3816',	'3817',	'3818',	'3819',	'3820',	'3821',	'3822',	'3823',	'3824',	'3826',	'3901',	'3902',	'3903',	'3904',	'3905',	'3906',	'3907',	'3908',	'3909',	'3910',	'3911',	'3912',	'3913',	'3914',	'3916',	'3917',	'3918',	'3919',	'3920',	'3921',	'3922',	'3923',	'3924',	'3925',	'3926',	'4002',	'4005',	'4006',	'4007',	'4008',	'4009',	'4010',	'4011',	'4012',	'4013',	'4014',	'4015',	'4016',	'4017',	'4104',	'4105',	'4106',	'4107',	'4108',	'4109',	'4110',	'4111',	'4112',	'4113',	'4114',	'4302',	'4303',	'4304',	'4402',	'4404',	'4405',	'4406',	'4407',	'4408',	'4409',	'4410',	'4411',	'4412',	'4413',	'4414',	'4415',	'4416',	'4417',	'4418',	'4419',	'4420',	'4421',	'4502',	'4503',	'4504',	'4701',	'4702',	'4703',	'4704',	'4705',	'4706',	'5004',	'5005',	'5006',	'5007',	'5105',	'5106',	'5107',	'5108',	'5109',	'5110',	'5111',	'5112',	'5113',	'5201',	'5203',	'5204',	'5205',	'5206',	'5207',	'5208',	'5209',	'5210',	'5211',	'5212',	'5501',	'5502',	'5503',	'5504',	'5506',	'5507',	'5508',	'5509',	'5510',	'5511',	'5512',	'5513',	'5514',	'5515',	'5516',	'6301',	'6302',	'6303',	'6304',	'6305',	'6306',	'6307',	'6308',	'6309',	'7002',	'7003',	'7004',	'7005',	'7006',	'7007',	'7008',	'7009',	'7010',	'7011',	'7012',	'7013',	'7014',	'7015',	'7016',	'7017',	'7018',	'7019',	'7020',	'7104',	'7105',	'7106',	'7107',	'7108',	'7109',	'7110',	'7111',	'7113',	'7114',	'7115',	'7116',	'7117',	'7118',	'7201',	'7202',	'7203',	'7205',	'7206',	'7207',	'7208',	'7209',	'7210',	'7211',	'7212',	'7213',	'7214',	'7215',	'7216',	'7217',	'7218',	'7219',	'7220',	'7221',	'7222',	'7223',	'7224',	'7225',	'7226',	'7227',	'7228',	'7229',	'7401',	'7402',	'7403',	'7405',	'7406',	'7407',	'7408',	'7409',	'7410',	'7411',	'7412',	'7413',	'7414',	'7415',	'7416',	'7417',	'7418',	'7419',	'7501',	'7502',	'7504',	'7505',	'7506',	'7507',	'7508',	'7601',	'7603',	'7604',	'7605',	'7606',	'7607',	'7608',	'7609',	'7610',	'7611',	'7612',	'7613',	'7614',	'7615',	'7616',	'7801',	'7804',	'7806',	'7901',	'7903',	'7904',	'7905',	'7906',	'7907',	'8001',	'8003',	'8007')
or left(tnved,6) in ('411510',	'710122',	'710229',	'710239',	'710391',	'710399', 'SSSSSS'))
group by "Год", spr_cntr."name"--, tnved
union all
--s
select right(period,4) as "Год", spr_cntr."name" "Страна", 's' "Группа", sum(stoim)/1000000 as "Сумма"
from tcbt left join spr_cntr on (tcbt.strana = spr_cntr.kod)
where napr = 'ИМ' and
(left(tnved,2) in ('14', '26')
or left(tnved,4) in ('0501',	'0502',	'0505',	'0506',	'0507',	'0508',	'0509',	'0510',	'0511',	'1211',	'1213',	'1301',	'1522',	'1802',	'2302',	'2303',	'2307',	'2308',	'2501',	'2502',	'2503',	'2504',	'2505',	'2506',	'2507',	'2508',	'2509',	'2510',	'2511',	'2512',	'2513',	'2514',	'2515',	'2516',	'2517',	'2518',	'2519',	'2520',	'2521',	'2522',	'2524',	'2525',	'2526',	'2527',	'2528',	'2529',	'2530',	'2701',	'2702',	'2703',	'2709',	'2714',	'3804',	'3825',	'3915',	'4001',	'4003',	'4004',	'4101',	'4102',	'4103',	'4301',	'4401',	'4403',	'4501',	'4707',	'5001',	'5002',	'5003',	'5101',	'5102',	'5103',	'5104',	'5202',	'5505',	'6310',	'7001',	'7112',	'7204',	'7404',	'7503',	'7602',	'7802',	'7902',	'8002')
or left(tnved,6) in ('271111',	'271121',	'411520',	'710110',	'710121',	'710210',	'710221',	'710231',	'710310'))
group by "Год", spr_cntr."name"--, tnved
union all
--ne
select right(period,4) as "Год", spr_cntr."name" "Страна", 'ne' "Группа", sum(stoim)/1000000 as "Сумма"
from tcbt left join spr_cntr on (tcbt.strana = spr_cntr.kod)
where napr = 'ИМ' and
(left(tnved,4) in ('2704',	'2705',	'2706',	'2707',	'2708',	'2710',	'2712',	'2713',	'2715',	'2716')
or left(tnved,6) in ('271112',	'271113',	'271114',	'271115',	'271116',	'271117',	'271118',	'271119',	'271129'))
group by "Год", spr_cntr."name"
) x
group by "Страна", "Группа"
order by  "Страна", "Группа"
--

--drop materialized view _2_list_3_import_add_bunc cascade 
create materialized view _2_list_3_import_add_bunc as
select
	"Группа стран"
	,"Страна"
	,"Группа"
	--,"2017"
	,"2018"
	,sum2018 as bunc18
	,"2019"
	,sum2019 as bunc19 
from list_3_import
left join _2_import19_bunc_gr on _2_import19_bunc_gr.country = list_3_import."Страна" and _2_import19_bunc_gr.gr = list_3_import."Группа"
left join _2_import18_bunc_gr on _2_import18_bunc_gr.country = list_3_import."Страна" and _2_import18_bunc_gr.gr = list_3_import."Группа"
--
--ex fish
--drop materialized view _2_list_3_export_add_bunc_fish cascade
create materialized view _2_list_3_export_add_bunc_fish as
select 
	"Группа стран"
	,"Страна"
	,"Группа"
	--,"2017"
	,"2018"
	,fish18.sum2018 as fish18
	,"2019"
	,_2_export19_bunc_gr.sum2019 as bunc19
	,fish.sum2019 as fish2019
from list_3_export
left join _2_export19_bunc_gr on _2_export19_bunc_gr.country = list_3_export."Страна" and _2_export19_bunc_gr.gr = list_3_export."Группа"
left join _2_export19_fish_gr fish on fish.country = list_3_export."Страна" and fish.gr = list_3_export."Группа"
left join _2_export18_fish_gr fish18 on fish18.country = list_3_export."Страна" and fish18.gr = list_3_export."Группа"
--
--drop materialized view _1_list_3_export_gr cascade
create materialized view _1_list_3_export_gr as
select 
	"Группа стран" gr_cntr
	,"Страна" cntr
	,'Всего' gr
	--,sum("2017") "2017"
	,sum("2018") "2018"
	,sum(fish18) fish18
	,sum("2019") "2019"
	,sum(bunc19) bunc19 
	,sum(fish2019) fish19
from _2_list_3_export_add_bunc_fish--list_3_export
group by "Группа стран", "Страна"
--

--
--drop materialized view _1_list_3_import_gr cascade
create materialized view _1_list_3_import_gr as
select 
	"Группа стран" gr_cntr
	,"Страна" cntr
	,'Всего' gr
	--,sum("2017") "2017"
	,sum("2018") "2018"
	,sum(_2_list_3_import_add_bunc.bunc18) bunc18
	,sum("2019") "2019"
	,sum(_2_list_3_import_add_bunc.bunc19) bunc19 
	--,sum(_2_import19_bunc_gr.sum2019) "bunc_2019"
from _2_list_3_import_add_bunc
--join _2_import19_bunc_gr on _2_import19_bunc_gr.country = list_3_import."Страна" and _2_import19_bunc_gr.gr = list_3_import."Группа" 
group by "Группа стран", "Страна"
--
--ex
--drop materialized view _1_list_3_export_gr_cntr
create materialized view _1_list_3_export_gr_cntr as
select 
	"Группа стран" gr_cntr
	,'Всего' cntr
	,"Группа" gr
	--,sum("2017") y17
	,sum("2018") y18
	,sum(fish18) fish18
	,sum("2019") y19
	,sum(bunc19) bunc19
	,sum(fish2019) fish19
from (
select "Группа стран","Страна","Группа","2018",fish18,"2019",bunc19,fish2019 
from _2_list_3_export_add_bunc_fish
union select gr_cntr,cntr,gr,"2018",fish18,"2019",bunc19,fish19 from _1_list_3_export_gr
union 
	select 
		'Всего' gr_cntr
		,'Всего' cntr
		,"Группа" gr
		--,sum("2017") y17
		,sum("2018") y18
		,sum(fish18) fish18
		,sum("2019") y19
		,sum(bunc19) bunc19
		,sum(fish2019) fish19
	from (
	select "Группа стран","Страна","Группа","2018",fish18,"2019",bunc19,fish2019 from _2_list_3_export_add_bunc_fish
	union select gr_cntr,cntr,gr,"2018",fish18,"2019",bunc19,fish19 from _1_list_3_export_gr) z
	group by "Группа"
) t
group by gr_cntr,gr
--
--
create materialized view _1_list_3_import_gr_cntr as
select 
	"Группа стран" gr_cntr
	,'Всего' cntr
	,"Группа" gr
	--,sum("2017") y17
	,sum("2018") y18
	,sum(bunc18) bunc18 
	,sum("2019") y19
	,sum(bunc19) bunc19 
from (
select * from _2_list_3_import_add_bunc
union select * from _1_list_3_import_gr
union 
	select 
		'Всего' gr_cntr
		,'Всего' cntr
		,"Группа" gr
		--,sum("2017") y17
		,sum("2018") y18
		,sum(bunc18) bunc18 
		,sum("2019") y19
		,sum(bunc19) bunc19 
	from (
	select * from _2_list_3_import_add_bunc
	union select * from _1_list_3_import_gr) z
	group by "Группа"
) t
group by gr_cntr,gr
--

--list 3 ex fin
select 
	"Группа стран"
	,"Страна"
	,"Группа"
	--,"2017"::numeric
	,"2018"::numeric
	,fish18::numeric
	,COALESCE("2018", 0)+COALESCE(fish18, 0) fts_fish18
	,"2019"::numeric
	,bunc19::numeric
	,fish2019::numeric
	,COALESCE("2019", 0)+COALESCE(fish2019, 0) fts_fish19 --COALESCE(bunc19, 0)+
from (
	select * from _2_list_3_export_add_bunc_fish--list_3_export
	union
	select * from _1_list_3_export_gr
	union
	select * from _1_list_3_export_gr_cntr
) a
--list 3 im fin
select 
	"Группа стран"
	,"Страна"
	,"Группа"
	,"2018"::numeric
	,bunc18::numeric
	,COALESCE("2018", 0)+COALESCE(bunc18, 0) fts_bunc_18
	,"2019"::numeric
	,bunc19::numeric	
	,COALESCE("2019", 0)+COALESCE(bunc19, 0) fts_bunc_19
from (
	select * from _2_list_3_import_add_bunc--list_3_import
	union
	select * from _1_list_3_import_gr
	union
	select * from _1_list_3_import_gr_cntr
	) a
--list 3--------------------------------------------------------------------end

	
	
--	
--коды tnved бункер
select 
	a.year,a.country,tnved,simple_nam,added_sum bunker2019
from _1_export19_bunc_added_sum a
join spr_tnvd b on a.tnved = b.kod 
--коды tnved рыба
select 
	a.year,a.country,code_6,simple_nam,added_sum fish2019
from stat_customs._1_export19_fish_added_sum a
join spr_tnvd b on a.code_6 = b.kod 
--
--SSSSSS list 5------------------------------------------------------------------------------------
	select case 
				when "Страна" in ('АЗЕРБАЙДЖАН', 'АРМЕНИЯ', 'БЕЛАРУСЬ', 'КАЗАХСТАН', 'КИРГИЗИЯ', 'МОЛДОВА, РЕСПУБЛИКА', 'ТАДЖИКИСТАН', 'ТУРКМЕНИЯ', 'УЗБЕКИСТАН', 'УКРАИНА') then 'СНГ'
				when "Страна" in ('АВСТРАЛИЯ','АВСТРИЯ','БЕЛЬГИЯ',	'СОЕДИНЕННОЕ КОРОЛЕВСТВО','ВЕНГРИЯ',	'ГЕРМАНИЯ',	'ГРЕЦИЯ','ДАНИЯ',	'ИЗРАИЛЬ',	'ИРЛАНДИЯ',	'ИСЛАНДИЯ',	'ИСПАНИЯ','ИТАЛИЯ','КАНАДА','ЛАТВИЯ','ЛЮКСЕМБУРГ','МЕКСИКА','НИДЕРЛАНДЫ','НОВАЯ ЗЕЛАНДИЯ',	'НОРВЕГИЯ',	'ПОЛЬША','ПОРТУГАЛИЯ','КОРЕЯ, РЕСПУБЛИКА','СЛОВАКИЯ',	'СЛОВЕНИЯ',	'СОЕДИНЕННЫЕ ШТАТЫ','ТУРЦИЯ','ФИНЛЯНДИЯ','ФРАНЦИЯ','ЧЕХИЯ','ЧИЛИ','ШВЕЙЦАРИЯ','ШВЕЦИЯ','ЭСТОНИЯ','ЯПОНИЯ') then 'ОЭСР'
		   else 'Другие'
		   end "Группа стран",
	"Страна",
	sum(case when "Год"='2017' then "Сумма" end) "2017", sum(case when "Год"='2018' then "Сумма" end) "2018", sum(case when "Год"='2019' then "Сумма" end) "2019"
	from (
	select right(period,4) as "Год", spr_cntr."name" "Страна", 'nn' "Группа",sum(stoim)/1000000 as "Сумма"
	from tcbt left join spr_cntr on (tcbt.strana = spr_cntr.kod)
	where napr = 'ЭК' and tnved = 'SSSSSS'
	group by "Год", spr_cntr."name"
	) x
	group by "Страна"
	--order by  "Страна"
union
select  
	'Всего',
	'Всего',
	sum(case when "Год"='2017' then "Сумма" end) "2017", sum(case when "Год"='2018' then "Сумма" end) "2018", sum(case when "Год"='2019' then "Сумма" end) "2019"
from (
select right(period,4) as "Год", spr_cntr."name" "Страна", 'nn' "Группа", sum(stoim)/1000000 as "Сумма"
from tcbt left join spr_cntr on (tcbt.strana = spr_cntr.kod)
where napr = 'ЭК' and tnved = 'SSSSSS'
group by "Год", spr_cntr."name"
) x
--SSSSSS list 5------------------------------------------------------------------------------------
--list 2 -------------------------------------------------------------------------
--im list 2 calc
drop materialized view _2_list_2_import_calc CASCADE
create materialized view _2_list_2_import_calc as 
select 
	"Группа стран","Страна","Группа" 
	--,"2017"
	,"2018"
	,sum2018 bunc18
	,coalesce("2018",0) + coalesce("sum2018",0) fts_bunc_18
	,"2019"
	,"sum2019" bunc19
	,coalesce("2019",0) + coalesce("sum2019",0) fts_bunc
from list_3_import
left join _2_import19_bunc_gr b on list_3_import."Страна" = b.country and list_3_import."Группа" = b.gr 
left join _2_import18_bunc_gr b18 on list_3_import."Страна" = b18.country and list_3_import."Группа" = b18.gr 
--
--drop materialized view _3_list_2_import_calc
create materialized view _3_list_2_import_calc as 
select 
	"Группа стран","Группа" 
	--,sum("2017") "2017"
	,sum("2018") "2018"
	,sum(bunc18) bunc18
	,sum(fts_bunc_18) fts_bunc18
	,sum("2019") "2019"
	,sum(bunc19) bunc19
	,sum(fts_bunc) fts_bunc19
from _2_list_2_import_calc
group by "Группа стран","Группа" 
--
create materialized view _4_list_2_import_calc as 
select * from _3_list_2_import_calc
union
select 
	'Всего'
	,"Группа" 
	--,sum("2017") "2017"
	,sum("2018") "2018"
	,sum(bunc18) bunc18
	,sum(fts_bunc18) fts_bunc18
	,sum("2019") "2019"
	,sum(bunc19) bunc19
	,sum(fts_bunc19) fts_bunc19
from _3_list_2_import_calc
group by "Группа"
order by "Группа стран","Группа"
--
--im list 2 fish fin
select 
	"Группа стран"
	,"Группа"
	--,"2017"::numeric
	,"2018"::numeric
	,bunc18::numeric
	,fts_bunc18::numeric
	,"2019"::numeric
	,bunc19::numeric
	,fts_bunc19::numeric
from _4_list_2_import_calc
union
select 
	"Группа стран"
	,'Всего'
	--,sum("2017")::numeric "2017"
	,sum("2018")::numeric "2018"
	,sum(bunc18)::numeric bunc18
	,sum(fts_bunc18)::numeric fts_bunc18
	,sum("2019")::numeric "2019"
	,sum(bunc19)::numeric bunc19
	,sum(fts_bunc19)::numeric fts_bunc19
from _4_list_2_import_calc
group by "Группа стран"
order by "Группа стран","Группа"

--ex list 2 calc ------------------------
drop materialized view _2_list_2_export_calc CASCADE
create materialized view _2_list_2_export_calc as 
select 
	"Группа стран","Страна","Группа" 
	--,"2017"
	,"2018"
	,b18.sum2018 fish18
	,coalesce("2018",0) + coalesce("sum2018",0) fts_fish18
	,"2019"
	,"sum2019" fish19
	,coalesce("2019",0) + coalesce("sum2019",0) fts_fish
from list_3_export
left join _2_export19_fish_gr b
on list_3_export."Страна" = b.country and list_3_export."Группа" = b.gr 
left join _2_export18_fish_gr b18
on list_3_export."Страна" = b18.country and list_3_export."Группа" = b18.gr 
--
select --*--
sum("2019")
from list_3_export
order by "Страна"

create materialized view _3_list_2_export_calc as 
select 
	"Группа стран","Группа" 
	--,sum("2017") "2017"
	,sum("2018") "2018"
	,sum(fish18) fish18
	,sum(fts_fish18) fts_fish18
	,sum("2019") "2019"
	,sum(fish19) fish19
	,sum(fts_fish) fts_fish19
from _2_list_2_export_calc
group by "Группа стран","Группа" 
--
create materialized view _4_list_2_export_calc as 
select * from _3_list_2_export_calc
union
select 
	'Всего'
	,"Группа" 
	--,sum("2017") "2017"
	,sum("2018") "2018"
	,sum(fish18) fish18
	,sum(fts_fish18) fts_fish18
	,sum("2019") "2019"
	,sum(fish19) fish19
	,sum(fts_fish19) fts_fish19
from _3_list_2_export_calc
group by "Группа"
order by "Группа стран","Группа"
--
--ex list 2 fish fin
select 
	"Группа стран"
	,"Группа"
	--,"2017"::numeric
	,"2018"::numeric
	,fish18::numeric
	,fts_fish18::numeric
	,"2019"::numeric
	,fish19::numeric
	,fts_fish19::numeric
from _4_list_2_export_calc
union
select 
	"Группа стран"
	,'Всего'
	--,sum("2017")::numeric "2017"
	,sum("2018")::numeric "2018"
	,sum(fish18)::numeric fish18
	,sum(fts_fish18)::numeric fts_fish18
	,sum("2019")::numeric "2019"
	,sum(fish19)::numeric fish19
	,sum(fts_fish19)::numeric fts_fish19
from _4_list_2_export_calc
group by "Группа стран"
order by "Группа стран","Группа"
----ex list 2 calc-----------------------------------------------------------------------------------------
--
--Экспорт по сырьевым группам и группам стран, всего (лист2)
--!!! следить за SSSSSS
drop materialized view list_2_import
create materialized view list_2_import as
select case 
			when "Страна" in ('АЗЕРБАЙДЖАН', 'АРМЕНИЯ', 'БЕЛАРУСЬ', 'КАЗАХСТАН', 'КИРГИЗИЯ', 'МОЛДОВА, РЕСПУБЛИКА', 'ТАДЖИКИСТАН', 'ТУРКМЕНИЯ', 'УЗБЕКИСТАН', 'УКРАИНА') then 'СНГ'
			when "Страна" in ('АВСТРАЛИЯ','АВСТРИЯ','БЕЛЬГИЯ',	'СОЕДИНЕННОЕ КОРОЛЕВСТВО','ВЕНГРИЯ','ГЕРМАНИЯ',	'ГРЕЦИЯ','ДАНИЯ',	'ИЗРАИЛЬ',	'ИРЛАНДИЯ',	'ИСЛАНДИЯ',	'ИСПАНИЯ','ИТАЛИЯ','КАНАДА','ЛАТВИЯ','ЛЮКСЕМБУРГ','МЕКСИКА','НИДЕРЛАНДЫ','НОВАЯ ЗЕЛАНДИЯ',	'НОРВЕГИЯ',	'ПОЛЬША','ПОРТУГАЛИЯ','КОРЕЯ, РЕСПУБЛИКА','СЛОВАКИЯ',	'СЛОВЕНИЯ',	'СОЕДИНЕННЫЕ ШТАТЫ','ТУРЦИЯ','ФИНЛЯНДИЯ','ФРАНЦИЯ','ЧЕХИЯ','ЧИЛИ','ШВЕЙЦАРИЯ','ШВЕЦИЯ','ЭСТОНИЯ','ЯПОНИЯ') then 'ОЭСР'
	   else 'Другие'
	   end "Группа стран",
"Группа",  
sum(case when "Год"='2017' then "Сумма" end) "2017", sum(case when "Год"='2018' then "Сумма" end) "2018", sum(case when "Год"='2019' then "Сумма" end) "2019"
from (
select right(period,4) as "Год", spr_cntr."name" "Страна", 'nn' "Группа", sum(stoim)/1000000 as "Сумма"
from tcbt left join spr_cntr on (tcbt.strana = spr_cntr.kod)
where napr = 'ИМ' and
--nn
(left(tnved,2) in ('01',	'02',	'03',	'04',	'06',	'07',	'08',	'09',	'10',	'11',	'16',	'17',	'19',	'20',	'21',	'22',	'24',	'28',	'29',	'30',	'31',	'32',	'33',	'34',	'35',	'36',	'37',	'42',	'46',	'48',	'49',	'53',	'54',	'56',	'57',	'58',	'59',	'60',	'61',	'62',	'64',	'65',	'66',	'67',	'68',	'69',	'73',	'81',	'82',	'83',	'84',	'85',	'86',	'87',	'88',	'89',	'90',	'91',	'92',	'93',	'94',	'95',	'96',	'97')
or left(tnved,4) in ('0504',	'1201',	'1202',	'1203',	'1204',	'1205',	'1206',	'1207',	'1208',	'1209',	'1210',	'1212',	'1214',	'1302',	'1501',	'1502',	'1503',	'1504',	'1505',	'1506',	'1507',	'1508',	'1509',	'1510',	'1511',	'1512',	'1513',	'1514',	'1515',	'1516',	'1517',	'1518',	'1519',	'1520',	'1521',	'1801',	'1803',	'1804',	'1805',	'1806',	'2301',	'2304',	'2305',	'2306',	'2309',	'2523',	'3801',	'3802',	'3803',	'3805',	'3806',	'3807',	'3808',	'3809',	'3810',	'3811',	'3812',	'3813',	'3814',	'3815',	'3816',	'3817',	'3818',	'3819',	'3820',	'3821',	'3822',	'3823',	'3824',	'3826',	'3901',	'3902',	'3903',	'3904',	'3905',	'3906',	'3907',	'3908',	'3909',	'3910',	'3911',	'3912',	'3913',	'3914',	'3916',	'3917',	'3918',	'3919',	'3920',	'3921',	'3922',	'3923',	'3924',	'3925',	'3926',	'4002',	'4005',	'4006',	'4007',	'4008',	'4009',	'4010',	'4011',	'4012',	'4013',	'4014',	'4015',	'4016',	'4017',	'4104',	'4105',	'4106',	'4107',	'4108',	'4109',	'4110',	'4111',	'4112',	'4113',	'4114',	'4302',	'4303',	'4304',	'4402',	'4404',	'4405',	'4406',	'4407',	'4408',	'4409',	'4410',	'4411',	'4412',	'4413',	'4414',	'4415',	'4416',	'4417',	'4418',	'4419',	'4420',	'4421',	'4502',	'4503',	'4504',	'4701',	'4702',	'4703',	'4704',	'4705',	'4706',	'5004',	'5005',	'5006',	'5007',	'5105',	'5106',	'5107',	'5108',	'5109',	'5110',	'5111',	'5112',	'5113',	'5201',	'5203',	'5204',	'5205',	'5206',	'5207',	'5208',	'5209',	'5210',	'5211',	'5212',	'5501',	'5502',	'5503',	'5504',	'5506',	'5507',	'5508',	'5509',	'5510',	'5511',	'5512',	'5513',	'5514',	'5515',	'5516',	'6301',	'6302',	'6303',	'6304',	'6305',	'6306',	'6307',	'6308',	'6309',	'7002',	'7003',	'7004',	'7005',	'7006',	'7007',	'7008',	'7009',	'7010',	'7011',	'7012',	'7013',	'7014',	'7015',	'7016',	'7017',	'7018',	'7019',	'7020',	'7104',	'7105',	'7106',	'7107',	'7108',	'7109',	'7110',	'7111',	'7113',	'7114',	'7115',	'7116',	'7117',	'7118',	'7201',	'7202',	'7203',	'7205',	'7206',	'7207',	'7208',	'7209',	'7210',	'7211',	'7212',	'7213',	'7214',	'7215',	'7216',	'7217',	'7218',	'7219',	'7220',	'7221',	'7222',	'7223',	'7224',	'7225',	'7226',	'7227',	'7228',	'7229',	'7401',	'7402',	'7403',	'7405',	'7406',	'7407',	'7408',	'7409',	'7410',	'7411',	'7412',	'7413',	'7414',	'7415',	'7416',	'7417',	'7418',	'7419',	'7501',	'7502',	'7504',	'7505',	'7506',	'7507',	'7508',	'7601',	'7603',	'7604',	'7605',	'7606',	'7607',	'7608',	'7609',	'7610',	'7611',	'7612',	'7613',	'7614',	'7615',	'7616',	'7801',	'7804',	'7806',	'7901',	'7903',	'7904',	'7905',	'7906',	'7907',	'8001',	'8003',	'8007')
or left(tnved,6) in ('411510',	'710122',	'710229',	'710239',	'710391',	'710399', 'SSSSSS'))
group by "Год", spr_cntr."name"--, tnved
union all
--s
select right(period,4) as "Год", spr_cntr."name" "Страна", 's' "Группа", sum(stoim)/1000000 as "Сумма"
from tcbt left join spr_cntr on (tcbt.strana = spr_cntr.kod)
where napr = 'ИМ' and
(left(tnved,2) in ('14', '26')
or left(tnved,4) in ('0501',	'0502',	'0505',	'0506',	'0507',	'0508',	'0509',	'0510',	'0511',	'1211',	'1213',	'1301',	'1522',	'1802',	'2302',	'2303',	'2307',	'2308',	'2501',	'2502',	'2503',	'2504',	'2505',	'2506',	'2507',	'2508',	'2509',	'2510',	'2511',	'2512',	'2513',	'2514',	'2515',	'2516',	'2517',	'2518',	'2519',	'2520',	'2521',	'2522',	'2524',	'2525',	'2526',	'2527',	'2528',	'2529',	'2530',	'2701',	'2702',	'2703',	'2709',	'2714',	'3804',	'3825',	'3915',	'4001',	'4003',	'4004',	'4101',	'4102',	'4103',	'4301',	'4401',	'4403',	'4501',	'4707',	'5001',	'5002',	'5003',	'5101',	'5102',	'5103',	'5104',	'5202',	'5505',	'6310',	'7001',	'7112',	'7204',	'7404',	'7503',	'7602',	'7802',	'7902',	'8002')
or left(tnved,6) in ('271111',	'271121',	'411520',	'710110',	'710121',	'710210',	'710221',	'710231',	'710310'))
group by "Год", spr_cntr."name"--, tnved
union all
--ne
select right(period,4) as "Год", spr_cntr."name" "Страна", 'ne' "Группа",sum(stoim)/1000000 as "Сумма"
from tcbt left join spr_cntr on (tcbt.strana = spr_cntr.kod)
where napr = 'ИМ' and
(left(tnved,4) in ('2704',	'2705',	'2706',	'2707',	'2708',	'2710',	'2712',	'2713',	'2715',	'2716')
or left(tnved,6) in ('271112',	'271113',	'271114',	'271115',	'271116',	'271117',	'271118',	'271119',	'271129'))
group by "Год", spr_cntr."name"
) x
group by "Группа стран", "Группа"
order by "Группа стран", "Группа"
--
create materialized view list_2_export as
select case 
			when "Страна" in ('АЗЕРБАЙДЖАН', 'АРМЕНИЯ', 'БЕЛАРУСЬ', 'КАЗАХСТАН', 'КИРГИЗИЯ', 'МОЛДОВА, РЕСПУБЛИКА', 'ТАДЖИКИСТАН', 'ТУРКМЕНИЯ', 'УЗБЕКИСТАН', 'УКРАИНА') then 'СНГ'
			when "Страна" in ('АВСТРАЛИЯ','АВСТРИЯ','БЕЛЬГИЯ',	'СОЕДИНЕННОЕ КОРОЛЕВСТВО','ВЕНГРИЯ','ГЕРМАНИЯ',	'ГРЕЦИЯ','ДАНИЯ',	'ИЗРАИЛЬ',	'ИРЛАНДИЯ',	'ИСЛАНДИЯ',	'ИСПАНИЯ','ИТАЛИЯ','КАНАДА','ЛАТВИЯ','ЛЮКСЕМБУРГ','МЕКСИКА','НИДЕРЛАНДЫ','НОВАЯ ЗЕЛАНДИЯ',	'НОРВЕГИЯ',	'ПОЛЬША','ПОРТУГАЛИЯ','КОРЕЯ, РЕСПУБЛИКА','СЛОВАКИЯ',	'СЛОВЕНИЯ',	'СОЕДИНЕННЫЕ ШТАТЫ','ТУРЦИЯ','ФИНЛЯНДИЯ','ФРАНЦИЯ','ЧЕХИЯ','ЧИЛИ','ШВЕЙЦАРИЯ','ШВЕЦИЯ','ЭСТОНИЯ','ЯПОНИЯ') then 'ОЭСР'
	   else 'Другие'
	   end "Группа стран",
"Группа",  
sum(case when "Год"='2017' then "Сумма" end) "2017", sum(case when "Год"='2018' then "Сумма" end) "2018", sum(case when "Год"='2019' then "Сумма" end) "2019"
from (
select right(period,4) as "Год", spr_cntr."name" "Страна", 'nn' "Группа", sum(stoim)/1000000 as "Сумма"
from tcbt join spr_cntr on (tcbt.strana = spr_cntr.kod)
where napr = 'ЭК' and
--nn
(left(tnved,2) in ('01',	'02',	'03',	'04',	'06',	'07',	'08',	'09',	'10',	'11',	'16',	'17',	'19',	'20',	'21',	'22',	'24',	'28',	'29',	'30',	'31',	'32',	'33',	'34',	'35',	'36',	'37',	'42',	'46',	'48',	'49',	'53',	'54',	'56',	'57',	'58',	'59',	'60',	'61',	'62',	'64',	'65',	'66',	'67',	'68',	'69',	'73',	'81',	'82',	'83',	'84',	'85',	'86',	'87',	'88',	'89',	'90',	'91',	'92',	'93',	'94',	'95',	'96',	'97')
or left(tnved,4) in ('0504',	'1201',	'1202',	'1203',	'1204',	'1205',	'1206',	'1207',	'1208',	'1209',	'1210',	'1212',	'1214',	'1302',	'1501',	'1502',	'1503',	'1504',	'1505',	'1506',	'1507',	'1508',	'1509',	'1510',	'1511',	'1512',	'1513',	'1514',	'1515',	'1516',	'1517',	'1518',	'1519',	'1520',	'1521',	'1801',	'1803',	'1804',	'1805',	'1806',	'2301',	'2304',	'2305',	'2306',	'2309',	'2523',	'3801',	'3802',	'3803',	'3805',	'3806',	'3807',	'3808',	'3809',	'3810',	'3811',	'3812',	'3813',	'3814',	'3815',	'3816',	'3817',	'3818',	'3819',	'3820',	'3821',	'3822',	'3823',	'3824',	'3826',	'3901',	'3902',	'3903',	'3904',	'3905',	'3906',	'3907',	'3908',	'3909',	'3910',	'3911',	'3912',	'3913',	'3914',	'3916',	'3917',	'3918',	'3919',	'3920',	'3921',	'3922',	'3923',	'3924',	'3925',	'3926',	'4002',	'4005',	'4006',	'4007',	'4008',	'4009',	'4010',	'4011',	'4012',	'4013',	'4014',	'4015',	'4016',	'4017',	'4104',	'4105',	'4106',	'4107',	'4108',	'4109',	'4110',	'4111',	'4112',	'4113',	'4114',	'4302',	'4303',	'4304',	'4402',	'4404',	'4405',	'4406',	'4407',	'4408',	'4409',	'4410',	'4411',	'4412',	'4413',	'4414',	'4415',	'4416',	'4417',	'4418',	'4419',	'4420',	'4421',	'4502',	'4503',	'4504',	'4701',	'4702',	'4703',	'4704',	'4705',	'4706',	'5004',	'5005',	'5006',	'5007',	'5105',	'5106',	'5107',	'5108',	'5109',	'5110',	'5111',	'5112',	'5113',	'5201',	'5203',	'5204',	'5205',	'5206',	'5207',	'5208',	'5209',	'5210',	'5211',	'5212',	'5501',	'5502',	'5503',	'5504',	'5506',	'5507',	'5508',	'5509',	'5510',	'5511',	'5512',	'5513',	'5514',	'5515',	'5516',	'6301',	'6302',	'6303',	'6304',	'6305',	'6306',	'6307',	'6308',	'6309',	'7002',	'7003',	'7004',	'7005',	'7006',	'7007',	'7008',	'7009',	'7010',	'7011',	'7012',	'7013',	'7014',	'7015',	'7016',	'7017',	'7018',	'7019',	'7020',	'7104',	'7105',	'7106',	'7107',	'7108',	'7109',	'7110',	'7111',	'7113',	'7114',	'7115',	'7116',	'7117',	'7118',	'7201',	'7202',	'7203',	'7205',	'7206',	'7207',	'7208',	'7209',	'7210',	'7211',	'7212',	'7213',	'7214',	'7215',	'7216',	'7217',	'7218',	'7219',	'7220',	'7221',	'7222',	'7223',	'7224',	'7225',	'7226',	'7227',	'7228',	'7229',	'7401',	'7402',	'7403',	'7405',	'7406',	'7407',	'7408',	'7409',	'7410',	'7411',	'7412',	'7413',	'7414',	'7415',	'7416',	'7417',	'7418',	'7419',	'7501',	'7502',	'7504',	'7505',	'7506',	'7507',	'7508',	'7601',	'7603',	'7604',	'7605',	'7606',	'7607',	'7608',	'7609',	'7610',	'7611',	'7612',	'7613',	'7614',	'7615',	'7616',	'7801',	'7804',	'7806',	'7901',	'7903',	'7904',	'7905',	'7906',	'7907',	'8001',	'8003',	'8007')
or left(tnved,6) in ('411510',	'710122',	'710229',	'710239',	'710391',	'710399', 'SSSSSS'))
group by "Год", spr_cntr."name"--, tnved
union all
--s
select right(period,4) as "Год", spr_cntr."name" "Страна", 's' "Группа", sum(stoim)/1000000 as "Сумма"
from tcbt join spr_cntr on (tcbt.strana = spr_cntr.kod)
where napr = 'ЭК' and
(left(tnved,2) in ('14', '26')
or left(tnved,4) in ('0501',	'0502',	'0505',	'0506',	'0507',	'0508',	'0509',	'0510',	'0511',	'1211',	'1213',	'1301',	'1522',	'1802',	'2302',	'2303',	'2307',	'2308',	'2501',	'2502',	'2503',	'2504',	'2505',	'2506',	'2507',	'2508',	'2509',	'2510',	'2511',	'2512',	'2513',	'2514',	'2515',	'2516',	'2517',	'2518',	'2519',	'2520',	'2521',	'2522',	'2524',	'2525',	'2526',	'2527',	'2528',	'2529',	'2530',	'2701',	'2702',	'2703',	'2709',	'2714',	'3804',	'3825',	'3915',	'4001',	'4003',	'4004',	'4101',	'4102',	'4103',	'4301',	'4401',	'4403',	'4501',	'4707',	'5001',	'5002',	'5003',	'5101',	'5102',	'5103',	'5104',	'5202',	'5505',	'6310',	'7001',	'7112',	'7204',	'7404',	'7503',	'7602',	'7802',	'7902',	'8002')
or left(tnved,6) in ('271111',	'271121',	'411520',	'710110',	'710121',	'710210',	'710221',	'710231',	'710310'))
group by "Год", spr_cntr."name"--, tnved
union all
--ne
select right(period,4) as "Год", spr_cntr."name" "Страна", 'ne' "Группа", sum(stoim)/1000000 as "Сумма"
from tcbt join spr_cntr on (tcbt.strana = spr_cntr.kod)
where napr = 'ЭК' and
(left(tnved,4) in ('2704',	'2705',	'2706',	'2707',	'2708',	'2710',	'2712',	'2713',	'2715',	'2716')
or left(tnved,6) in ('271112',	'271113',	'271114',	'271115',	'271116',	'271117',	'271118',	'271119',	'271129'))
group by "Год", spr_cntr."name"
) x
group by "Группа стран", "Группа"
order by "Группа стран", "Группа"

--
--list 2 ssssss 
select case 
			when "Страна" in ('АЗЕРБАЙДЖАН', 'АРМЕНИЯ', 'БЕЛАРУСЬ', 'КАЗАХСТАН', 'КИРГИЗИЯ', 'МОЛДОВА, РЕСПУБЛИКА', 'ТАДЖИКИСТАН', 'ТУРКМЕНИЯ', 'УЗБЕКИСТАН', 'УКРАИНА') then 'СНГ'
			when "Страна" in ('АВСТРАЛИЯ','АВСТРИЯ','БЕЛЬГИЯ',	'СОЕДИНЕННОЕ КОРОЛЕВСТВО','ВЕНГРИЯ','ГЕРМАНИЯ',	'ГРЕЦИЯ','ДАНИЯ',	'ИЗРАИЛЬ',	'ИРЛАНДИЯ',	'ИСЛАНДИЯ',	'ИСПАНИЯ','ИТАЛИЯ','КАНАДА','ЛАТВИЯ','ЛЮКСЕМБУРГ','МЕКСИКА','НИДЕРЛАНДЫ','НОВАЯ ЗЕЛАНДИЯ',	'НОРВЕГИЯ',	'ПОЛЬША','ПОРТУГАЛИЯ','КОРЕЯ, РЕСПУБЛИКА','СЛОВАКИЯ',	'СЛОВЕНИЯ',	'СОЕДИНЕННЫЕ ШТАТЫ','ТУРЦИЯ','ФИНЛЯНДИЯ','ФРАНЦИЯ','ЧЕХИЯ','ЧИЛИ','ШВЕЙЦАРИЯ','ШВЕЦИЯ','ЭСТОНИЯ','ЯПОНИЯ') then 'ОЭСР'
	   else 'Другие'
	   end "Группа стран",
sum(case when "Год"='2017' then "Сумма" end) "2017", sum(case when "Год"='2018' then "Сумма" end) "2018", sum(case when "Год"='2019' then "Сумма" end) "2019"
from (
	select right(period,4) as "Год", spr_cntr."name" "Страна", sum(stoim)/1000000 as "Сумма"
	from tcbt left join spr_cntr on (tcbt.strana = spr_cntr.kod)
	where napr = 'ИМ' and tnved = ('SSSSSS')
	group by "Год", spr_cntr."name"
) t
group by "Группа стран"
union
select 'Всего' "Группа стран",
sum(case when "Год"='2017' then "Сумма" end) "2017", sum(case when "Год"='2018' then "Сумма" end) "2018", sum(case when "Год"='2019' then "Сумма" end) "2019"
from (
	select right(period,4) as "Год", spr_cntr."name" "Страна",sum(stoim)/1000000 as "Сумма"
	from tcbt left join spr_cntr on (tcbt.strana = spr_cntr.kod)
	where napr = 'ИМ' and tnved = ('SSSSSS')
	group by "Год", spr_cntr."name"
) t
group by "Группа стран"
order by "Группа стран"
--
--list 2 -------------------------------------------------------------------------------end



--select case when length(tnved) = 5 then '0' || tnved else tnved end
--from tcbt

--update tcbt 
--set tnved = case when length(tnved) = 5 then '0' || tnved else tnved end



create materialized view cntr_groups as
select 
	spr_cntr."name"
	,case 
			when spr_cntr."name" in ('АЗЕРБАЙДЖАН', 'АРМЕНИЯ', 'БЕЛАРУСЬ', 'КАЗАХСТАН', 'КИРГИЗИЯ', 'МОЛДОВА, РЕСПУБЛИКА', 'ТАДЖИКИСТАН', 'ТУРКМЕНИЯ', 'УЗБЕКИСТАН', 'УКРАИНА') then 'СНГ'
			when spr_cntr."name" in ('АВСТРАЛИЯ','АВСТРИЯ','БЕЛЬГИЯ',	'СОЕДИНЕННОЕ КОРОЛЕВСТВО','ВЕНГРИЯ','ГЕРМАНИЯ',	'ГРЕЦИЯ','ДАНИЯ',	'ИЗРАИЛЬ',	'ИРЛАНДИЯ',	'ИСЛАНДИЯ',	'ИСПАНИЯ','ИТАЛИЯ','КАНАДА','ЛАТВИЯ','ЛЮКСЕМБУРГ','МЕКСИКА','НИДЕРЛАНДЫ','НОВАЯ ЗЕЛАНДИЯ',	'НОРВЕГИЯ',	'ПОЛЬША','ПОРТУГАЛИЯ','КОРЕЯ, РЕСПУБЛИКА','СЛОВАКИЯ',	'СЛОВЕНИЯ',	'СОЕДИНЕННЫЕ ШТАТЫ','ТУРЦИЯ','ФИНЛЯНДИЯ','ФРАНЦИЯ','ЧЕХИЯ','ЧИЛИ','ШВЕЙЦАРИЯ','ШВЕЦИЯ','ЭСТОНИЯ','ЯПОНИЯ') then 'ОЭСР'
	   else 'Другие'
	   end cntr_gr
from spr_cntr	   
	   
	   
	   
	   
	   
	   
